"""Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:

[”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]

Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).

Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”

Використовуйте блок try | except, щоб уникнути інших символів, окрім чисел у списку.

Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”"""

test_list: list[str] = ["1,2,3,4", "1,2,3,4,50", "qwerty11,2,3"]

def elem_only_num_sum(list_of_dirty_strings):
    for elem in list_of_dirty_strings:
        try:
            parts = elem.split(",")
            nums = [int(char) for char in parts]
            total = sum(nums)
        except ValueError:
            print("Не можу це зробити!")
        else:
            print(total)

elem_only_num_sum(test_list)

