"""Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так і маленькі).
Цикл не повинен завершитися, якщо користувач ввів слово без букви "h"."""
stop_char: str = "h"
while True:
    user_input: str = input("Здісніть будь ласка ввод: ").strip()
    if not user_input:
        print(f"Ввод не може бути порожнім. Спробуйте ще раз")
        continue
    if stop_char in user_input.lower():
        print("Цикл прервано — слово містить літеру 'h'.")
        break